tutorials/viscoelastic/viscoelasticFluidFoam/Leonov/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.0032;

vertices
(
    (0 0 0)
    (80 0 0)
    (0 1 0)
    (80 1 0)
    (0 2.5 0)
    (80 2.5 0)
    (0 4 0)
    (80 4 0)
    (130 0 0)
    (130 1 0)
    (0 0 0.1)
    (80 0 0.1)
    (0 1 0.1)
    (80 1 0.1)
    (0 2.5 0.1)
    (80 2.5 0.1)
    (0 4 0.1)
    (80 4 0.1)
    (130 0 0.1)
    (130 1 0.1)
);

blocks
(

    hex (0 1 3 2 10 11 13 12) (150 30 1) simpleGrading (0.002 0.3 1)
    hex (2 3 5 4 12 13 15 14) (150 45 1) simpleGrading (0.002 3.333 1)
    hex (4 5 7 6 14 15 17 16) (150 45 1) simpleGrading (0.002 0.3 1)
    hex (1 8 9 3 11 18 19 13) (90 30 1) simpleGrading (500 0.3 1)

);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 10 12 2)
            (2 12 14 4)
            (4 14 16 6)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (6 16 17 7)
            (5 7 17 15)
            (3 5 15 13)
            (3 13 19 9)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (8 9 19 18)
        );
    }
    simetry
    {
        type symmetryPlane;
        faces
        (
            (0 1 11 10)
            (1 8 18 11)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 2 3 1)
            (2 4 5 3)
            (4 6 7 5)
            (1 3 9 8)
            (10 11 13 12)
            (12 13 15 14)
            (14 15 17 16)
            (11 18 19 13)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
